#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.oci_core_images.ubuntu: Reading...
data.oci_identity_availability_domain.ad: Reading...
data.oci_identity_availability_domains.ads: Reading...
data.oci_identity_availability_domains.ads: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-4130005358]
data.oci_identity_availability_domain.ad: Read complete after 0s [id=ocid1.availabilitydomain.oc1..aaaaaaaapjv4p3qtly2fesrig77q4tlmi3wvakeet6fskc7do2fmawz3xctq]
data.oci_core_images.ubuntu: Read complete after 0s [id=CoreImagesDataSource-992264993]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_core_instance.jacket_server will be created
  + resource "oci_core_instance" "jacket_server" {
      + availability_domain                 = "jGky:UK-LONDON-1-AD-2"
      + boot_volume_id                      = (known after apply)
      + capacity_reservation_id             = (known after apply)
      + compartment_id                      = "ocid1.compartment.oc1..aaaaaaaabkkg4cr75mz736fqiufl54rjxa6n4zdlsi7smap3bieuhoifz7qa"
      + compute_cluster_id                  = (known after apply)
      + dedicated_vm_host_id                = (known after apply)
      + defined_tags                        = (known after apply)
      + display_name                        = "jacket-server"
      + extended_metadata                   = (known after apply)
      + fault_domain                        = (known after apply)
      + freeform_tags                       = {
          + "Project" = "jacket-server"
        }
      + hostname_label                      = (known after apply)
      + id                                  = (known after apply)
      + image                               = (known after apply)
      + instance_configuration_id           = (known after apply)
      + ipxe_script                         = (known after apply)
      + is_cross_numa_node                  = (known after apply)
      + is_pv_encryption_in_transit_enabled = (known after apply)
      + launch_mode                         = (known after apply)
      + metadata                            = {
          + "ssh_authorized_keys" = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDqveEN3Yh+9rLfMILWB94hoeydUHznBIm1vQXr0iOF6nnwt+m7WwjzL4lPUMXKAQR8p4DkbVdkT8mpHXNtkNq5OnaQOVoaWzt+ZcbgNtxtcvOh8tL1Azx+Jp0ooszzYSCSoGIkl2dOARAN08c6urAjINdgpneVNXxEfrqXfUDQIrgd/o94z5vjtf/XNqqOL7u1yXyI6FllP924MZeEqT+9ZhlarIM3c9x1CnH8yd3JOw6l56paKsYry4voKhdKbNFtbpxFon1SCvBvv2Dbl0XphJpruq0sPqJvK1fOe0ytBnc+knyBFWY3FLceOR/2qNRiE7TB4wXaXaRGCoka5jrP jposer@herbert.local"
          + "user_data"           = "CiMhL2Jpbi9iYXNoCnNldCAtZQoKIyBVcGRhdGUgc3lzdGVtCmFwdC1nZXQgdXBkYXRlCmFwdC1nZXQgdXBncmFkZSAteQoKIyBJbnN0YWxsIGRlcGVuZGVuY2llcwphcHQtZ2V0IGluc3RhbGwgLXkgXAogICAgY2EtY2VydGlmaWNhdGVzIFwKICAgIGN1cmwgXAogICAgZ251cGcgXAogICAgbHNiLXJlbGVhc2UgXAogICAgZ2l0CgojIEluc3RhbGwgRG9ja2VyCmluc3RhbGwgLW0gMDc1NSAtZCAvZXRjL2FwdC9rZXlyaW5ncwpjdXJsIC1mc1NMIGh0dHBzOi8vZG93bmxvYWQuZG9ja2VyLmNvbS9saW51eC91YnVudHUvZ3BnIHwgZ3BnIC0tZGVhcm1vciAtbyAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnCmNobW9kIGErciAvZXRjL2FwdC9rZXlyaW5ncy9kb2NrZXIuZ3BnCgplY2hvIFwKICAiZGViIFthcmNoPSQoZHBrZyAtLXByaW50LWFyY2hpdGVjdHVyZSkgc2lnbmVkLWJ5PS9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGddIGh0dHBzOi8vZG93bmxvYWQuZG9ja2VyLmNvbS9saW51eC91YnVudHUgXAogICQobHNiX3JlbGVhc2UgLWNzKSBzdGFibGUiIHwgdGVlIC9ldGMvYXB0L3NvdXJjZXMubGlzdC5kL2RvY2tlci5saXN0ID4gL2Rldi9udWxsCgphcHQtZ2V0IHVwZGF0ZQphcHQtZ2V0IGluc3RhbGwgLXkgZG9ja2VyLWNlIGRvY2tlci1jZS1jbGkgY29udGFpbmVyZC5pbyBkb2NrZXItYnVpbGR4LXBsdWdpbiBkb2NrZXItY29tcG9zZS1wbHVnaW4KCiMgQWRkIG9wYyB1c2VyIHRvIGRvY2tlciBncm91cAp1c2VybW9kIC1hRyBkb2NrZXIgb3BjCgojIFN0YXJ0IGFuZCBlbmFibGUgRG9ja2VyCnN5c3RlbWN0bCBzdGFydCBkb2NrZXIKc3lzdGVtY3RsIGVuYWJsZSBkb2NrZXIKCiMgQ3JlYXRlIGFwcCBkaXJlY3RvcnkKbWtkaXIgLXAgL29wdC9qYWNrZXQtc2VydmVyCmNob3duIG9wYzpvcGMgL29wdC9qYWNrZXQtc2VydmVyCgojIE5vdGU6IEZpcmV3YWxsIHJ1bGVzIGFyZSBtYW5hZ2VkIHZpYSBPQ0kgU2VjdXJpdHkgTGlzdHMKIyBObyBuZWVkIGZvciB1ZncgLSBPQ0kgaGFuZGxlcyBhbGwgZmlyZXdhbGwgcnVsZXMgYXQgdGhlIG5ldHdvcmsgbGV2ZWwKCiMgTG9nIGNvbXBsZXRpb24KZWNobyAiVXNlciBkYXRhIHNjcmlwdCBjb21wbGV0ZWQgYXQgJChkYXRlKSIgPj4gL3Zhci9sb2cvdXNlci1kYXRhLmxvZwplY2hvICJEb2NrZXIgaW5zdGFsbGVkIGFuZCByZWFkeS4gTmV4dCBzdGVwczoiID4+IC92YXIvbG9nL3VzZXItZGF0YS5sb2cKZWNobyAiMS4gRGVwbG95IHlvdXIgY29kZSB0byAvb3B0L2phY2tldC1zZXJ2ZXIiID4+IC92YXIvbG9nL3VzZXItZGF0YS5sb2cKZWNobyAiMi4gQ3JlYXRlIGNvbmZpZy5pbmkgd2l0aCB5b3VyIGNyZWRlbnRpYWxzIiA+PiAvdmFyL2xvZy91c2VyLWRhdGEubG9nCmVjaG8gIjMuIFJ1bjogY2QgL29wdC9qYWNrZXQtc2VydmVyICYmIGRvY2tlciBjb21wb3NlIHVwIC1kIiA+PiAvdmFyL2xvZy91c2VyLWRhdGEubG9nCg=="
        }
      + private_ip                          = (known after apply)
      + public_ip                           = (known after apply)
      + region                              = (known after apply)
      + shape                               = "VM.Standard.E2.1.Micro"
      + state                               = (known after apply)
      + subnet_id                           = (known after apply)
      + system_tags                         = (known after apply)
      + time_created                        = (known after apply)
      + time_maintenance_reboot_due         = (known after apply)

      + agent_config (known after apply)

      + availability_config (known after apply)

      + create_vnic_details {
          + assign_ipv6ip          = (known after apply)
          + assign_public_ip       = "true"
          + defined_tags           = (known after apply)
          + display_name           = (known after apply)
          + freeform_tags          = (known after apply)
          + hostname_label         = "jacketserver"
          + nsg_ids                = (known after apply)
          + private_ip             = (known after apply)
          + skip_source_dest_check = (known after apply)
          + subnet_id              = (known after apply)
          + vlan_id                = (known after apply)

          + ipv6address_ipv6subnet_cidr_pair_details (known after apply)
        }

      + instance_options (known after apply)

      + launch_options (known after apply)

      + launch_volume_attachments (known after apply)

      + platform_config (known after apply)

      + preemptible_instance_config (known after apply)

      + shape_config (known after apply)

      + source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + boot_volume_vpus_per_gb = (known after apply)
          + source_id               = "ocid1.image.oc1.uk-london-1.aaaaaaaaaqqnwwvppjnkkabddcygclu3vbdytqyfou5cr65lqis6ztakru4a"
          + source_type             = "image"

          + instance_source_image_filter_details (known after apply)
        }

      + timeouts {
          + create = "10m"
        }
    }

  # oci_core_internet_gateway.igw will be created
  + resource "oci_core_internet_gateway" "igw" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabkkg4cr75mz736fqiufl54rjxa6n4zdlsi7smap3bieuhoifz7qa"
      + defined_tags   = (known after apply)
      + display_name   = "vcn-jacket-server-igw"
      + enabled        = true
      + freeform_tags  = {
          + "Project" = "jacket-server"
        }
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)
    }

  # oci_core_route_table.rt will be created
  + resource "oci_core_route_table" "rt" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabkkg4cr75mz736fqiufl54rjxa6n4zdlsi7smap3bieuhoifz7qa"
      + defined_tags   = (known after apply)
      + display_name   = "vcn-jacket-server-rt"
      + freeform_tags  = {
          + "Project" = "jacket-server"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + description       = (known after apply)
          + destination       = "0.0.0.0/0"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
          + route_type        = (known after apply)
        }
    }

  # oci_core_security_list.jacket_server_sl will be created
  + resource "oci_core_security_list" "jacket_server_sl" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaabkkg4cr75mz736fqiufl54rjxa6n4zdlsi7smap3bieuhoifz7qa"
      + defined_tags   = (known after apply)
      + display_name   = "jacket-server-security-list"
      + freeform_tags  = {
          + "Project" = "jacket-server"
        }
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = (known after apply)

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = (known after apply)
        }

      + ingress_security_rules {
          + description = "Flask application access"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 5000
              + min = 5000
            }
        }
      + ingress_security_rules {
          + description = "SSH access"
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
    }

  # oci_core_subnet.subnet will be created
  + resource "oci_core_subnet" "subnet" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.1.0/24"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaabkkg4cr75mz736fqiufl54rjxa6n4zdlsi7smap3bieuhoifz7qa"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "subnet-jacket-server"
      + dns_label                  = "subnet"
      + freeform_tags              = {
          + "Project" = "jacket-server"
        }
      + id                         = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = (known after apply)
      + route_table_id             = (known after apply)
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = (known after apply)
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

  # oci_core_vcn.vcn will be created
  + resource "oci_core_vcn" "vcn" {
      + byoipv6cidr_blocks               = (known after apply)
      + cidr_block                       = (known after apply)
      + cidr_blocks                      = [
          + "10.0.0.0/16",
        ]
      + compartment_id                   = "ocid1.compartment.oc1..aaaaaaaabkkg4cr75mz736fqiufl54rjxa6n4zdlsi7smap3bieuhoifz7qa"
      + default_dhcp_options_id          = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_list_id         = (known after apply)
      + defined_tags                     = (known after apply)
      + display_name                     = "vcn-jacket-server"
      + dns_label                        = "jacketserver"
      + freeform_tags                    = {
          + "Project" = "jacket-server"
        }
      + id                               = (known after apply)
      + ipv6cidr_blocks                  = (known after apply)
      + ipv6private_cidr_blocks          = (known after apply)
      + is_ipv6enabled                   = (known after apply)
      + is_oracle_gua_allocation_enabled = (known after apply)
      + state                            = (known after apply)
      + time_created                     = (known after apply)
      + vcn_domain_name                  = (known after apply)

      + byoipv6cidr_details (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_url             = (known after apply)
  + instance_ocid       = (known after apply)
  + instance_private_ip = (known after apply)
  + instance_public_ip  = (known after apply)
  + ssh_command         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @JPoser, Action: `pull_request`*